Revit 2027 API
TemporaryViewModes.CustomTitle Property
 Custom title for the TemporaryViewProperties mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CustomTitle { get; set; }
Public Property CustomTitle As String
	Get
	Set
public:
property String^ CustomTitle {
	String^ get ();
	void set (String^ value);
}
member CustomTitle : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 If custom title is not empty, Temporary View Properties mode displays it in the upper left corner of colored view frame.
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace